## Отчет по лабораторной работе № 1

#### № группы: `ПМ-2402`

#### Выполнил: `Абрамовский Дмитрий Антонович`

#### Вариант: `1`

### Cодержание:

- [Постановка задачи](#1-постановка-задачи)
- [Входные и выходные данные](#2-входные-и-выходные-данные)
- [Математическая модель](#25-математическая-модель)
- [Выбор структуры данных](#3-выбор-структуры-данных)
- [Алгоритм](#4-алгоритм)
- [Программа](#5-программа)
- [Анализ правильности решения](#6-анализ-правильности-решения)

### 1. Постановка задачи

- Условие задачи
> Дано неравенство: $\frac{x - a}{b · x} ≥ 0$. Где a и b — параметры (вводятся с клавиатуры). Решите его для x.
1. Ввод двух чисел с терминала
2. Обработка числа и обработка всех возможных пар a, b (всего их девять случаев поскольку для каждого числа есть три варианта (число равно 0, число больше 0, число меньше 0) и таких чисел 2)
3. Вывод ответа в зависимости от чисел
#### Некоторые сведения о неравенстве

- Рассмотрим неравенство, и заметим что одним из решений всегда будет 0 со строгим знаком.
Также вторым решением неравенства всегда будет коэффициент a с различным знаком.
- b не равно 0 в данном неравенстве. Поэтому мы можем начать проверку с b, а затем рассмотреть все пары (a, b)

### 2. Входные и выходные данные
#### Входные данные

|             | Тип                | min значение    | max значение   |
|-------------|--------------------|-----------------|----------------|
| a (Число 1) | Вещественное число |    -1,7E+308    |    1,7E+308    |
| b (Число 2) | Вещественное число |    -1,7E+308    |    1,7E+308    |

Заметим, что ограничения на числа нет, поэтому числа ограничиваются только границами типа данных double

#### Выходные данные
|             | Тип                | min значение    | max значение   |
|-------------|--------------------|-----------------|----------------|
|    Ответ    | Вещественное число |    -1,7E+308    |    1,7E+308    |

Так как число не изменяется во время вычислений, то мы не можем выйти за границы типа данных

### 3. Выбор структуры данных

Поскольку никаких ограничений из условия мы не получаем, поэтому программа должна быть готова принять на вход любое число. Исходя из вышесказанного, мы понимаем, что нужно использовать структуру данных double. Она не ограничивает пользователя в выборе числа. 

### 4. Алгоритм

* Рассмотрим программу более подробно. Так как основным критическим случаем является b = 0 начнем блок условного оператора с него. Если пользователь ввел число b = 0 неравенство перестает иметь решения. 
* Если пользователь ввел b != 0, то программа начинает анализировать число a. В зависимости от пары чисел a, b программа делает вывод, какие промежутки нужно указать в ответе.
```mermaid
flowchart TD;
  node3([Старт]) ==> B[/Ввести: a, b/]
  B ==> C{b = 0}
  C ==Да==> D[/Ø - неравенство не имеет решений/]
  C ==Нет==> E{a = 0}
  E ==Да==> F{b > 0}
  F ==Да==> H[/x - любое число, исключая 0/]
  F ==Нет==> I[/Ø - неравенство не имеет решений/]
  E ====> G{a > 0}
  G ==Да==> J{b > 0}
  G ==Нет==> K{b > 0}
  J ==Да==> L[/x < 0 and x ≥ a/]
  J ==Нет==> M[/x > 0 and x ≤ a/]
  K ==Да==> N[/x ≤ a and x > 0/]
  K ==Нет==> O[/x > 0 and x ≤ a/]
```


### 5. Программа

```java
// Импортируем класс Scanner
import java.util.Scanner;
public class Main {
    public static void main(String[] args){
        // Создаем объект класса Scanner
        Scanner scan = new Scanner(System.in);
        // Создаем переменные, заполняемые с клавиатуры
        double a = scan.nextDouble();
        double b = scan.nextDouble();
        // Размышления:
        // Ограничения: x!=0 => знак неравенства на всех промежутках с 0 будет строгим
        // x - a = 0 => x = a
        // bx = 0 => x = 0
        // Заметим, что на знак неравенства влияет только коэффициент b =>
        // Если b > 0 => ≥; Иначе знак меняется на противоположный
        if(b == 0){
            // Если b = 0 => Неравенство не имеет решений
            System.out.println("Ø - неравенство не имеет решений");
        }else{
            if(a == 0){
                if(b > 0){
                    // Неравенство принимает вид x-0/bx (b>0) => тк x != 0 можем сократить
                    // => получаем неравенство -> 1/b (b>0) => тк b>0 то неравенство верное
                    // => x - любой исключая ограничения
                    System.out.println("x - любое число, исключая 0");
                } else{
                    // Неравенство принимает вид x-0/bx (b<0) => тк x != 0 можем сократить
                    // => получаем неравенство -> 1/(-b) (b<0) => тк b<0 то неравенство неверно
                    // => неравенство не имеет решений
                    System.out.println("Ø - неравенство не имеет решений");
                }
            } else{
                if(a > 0){
                    if(b > 0){
                        // a>0, b>0 => b = 0; x = -a
                        // так как знак неравенства нестрого больше => x < 0 x ≥ a
                        System.out.println("x ∊ (-∞,0) ∪ [" + a + ", +∞)");
                        System.out.println("x < 0 and " + "x ≥ " + a);
                    } else{
                        // a>0, b<0 => b = 0; x = -a; знак неравенства изменен на противоположный =>
                        // так как знак неравенства нестрого меньше => x < 0 x ≥ a
                        System.out.println("x ∊ (0," + a + "]");
                        System.out.println("x > 0 and x ≤ " + a);
                    }
                } else{
                    // В данной ветке размышления аналогичны предыдущему блоку, но так как знак, а изменился =>
                    // a будет находиться слева от нуля.
                    if(b > 0){
                        System.out.println("x ∊ (-∞," + a + "] ∪ (0, +∞)");
                        System.out.println("x ≤ " + a + " and x > 0");
                    } else{
                        System.out.println("x ∊ (0," + a + "]");
                        System.out.println("x > 0 and x ≤ " + a);
                    }
                }
            }
        }

    }
}
```

### 6. Анализ правильности решения
Рассмотрим все потенциальные случаи, которые могут принимать параметры a, b

1. ##### a>0, b=0

- Input:
    ```
  1 0
    ```
- Output:
    ```
    Ø - неравенство не имеет решений
    ```

2. ##### a=0, b=0

- Input:
    ```
  0 0
    ```
- Output:
    ```
    Ø - неравенство не имеет решений
    ```
3. ##### a<0, b=0

- Input:
    ```
  -1 0
    ```
- Output:
    ```
    Ø - неравенство не имеет решений
    ```

4. ##### a=0, b>0

- Input:
    ```
  0 5
    ```
- Output:
    ```
    x - любое число, исключая 0
    ```

5. ##### a=0, b<0

- Input:
    ```
  0 -5
    ```
- Output:
    ```
    Ø - неравенство не имеет решений
    ```

6. ##### a>0, b>0

- Input:
    ```
  5 5
    ```
- Output:
    ```
    x ∊ (-∞,0) ∪ [5.0, +∞)
    x < 0 and x ≥ 5.0
    ```

7. ##### a>0, b<0

- Input:
    ```
  5 -5
    ```
- Output:
    ```
    x ∊ (-∞,0) ∪ [5.0, +∞)
    x < 0 and x ≥ 5.0
    ```

8. ##### a<0, b>0

- Input:
    ```
  -5 5
    ```
- Output:
    ```
    x ∊ (-∞, -5.0] ∪ (0, +∞)
    x ≤ -5.0 and x > 0
    ```

9. ##### a<0, b<0

- Input:
    ```
  -5 -5
    ```
- Output:
    ```
    x ∊ [-5.0, 0)
    x ≥ -5.0 and x < 0
    ```
